ssh/正则表达式.org
* 元字符
 - \b 代表单词的开头和结尾,匹配位置
 - * 匹配除换行符外的任意字符
 - \d 匹配数字
 - \d{3} 匹配出现3个任意数字
 .  |  匹配除换行符以外的任意字符
 \w | 匹配字母或数字或下划线或汉字
 \s | 匹配任意的空白符
 \d | 匹配数字
 \b | 匹配单词的开始或结束
 ^  | 匹配字符串的开始
 $  | 匹配字符串的结束
 - 例子:
  中国电话: 0\d{2}-\d{8}
* 字符转义
* 重复
* 字符类
* 分支条件
* 反义
* 分组
* 后向引用
* 零宽断言
* 负向零宽断言
* 注释
* 贪婪与懒惰
* 处理选项
* 平衡组/递归匹配
* 工具
 - 在线测试
  + http://regexpal.com/
* 文档
 . Any character except newline. 
\. A period (and so on for \*, \(, \\, etc.) 
^ The start of the string. 
$ The end of the string. 
\d,\w,\s A digit, word character [A-Za-z0-9_], or whitespace. 
\D,\W,\S Anything except a digit, word character, or whitespace. 
[abc] Character a, b, or c. 
[a-z] a through z. 
[^abc] Any character except a, b, or c. 
aa|bb Either aa or bb. 
? Zero or one of the preceding element. 
/* Zero or more of the preceding element. 
+ One or more of the preceding element. 
{n} Exactly n of the preceding element. 
{n,} n or more of the preceding element. 
{m,n} Between m and n of the preceding element. 
??,*?,+?,
{n}?, etc. Same as above, but as few as possible. 
(expr) Capture expr for use with \1, etc. 
(?:expr) Non-capturing group. 
(?=expr) Followed by expr. 
(?!expr) Not followed by expr. 

